# PROJETO ESTUDO ANALISE DE DADOS COM PYTHON

*PROJETO PROPOSTO PELO GUIA DE ESTUDO MICROSOFT* 
VOCÊ PODE SEGUIR O GUA POR AQUI [GUIA](https://learn.microsoft.com/pt-br/training/modules/plan-moon-mission-using-python-pandas/2-rock-samples)

# ETAPAS DO PROCESSO DE ESTUDO

## 1 - ESCOLHER O DATA SET DE ESTUDO
    PARA ESSE PROJETO, DATA SET PROPOSTO FOI UM CONJUNTO DE DADOS COM AMOSTRAS DAS SEIS MISSÕES APOLLO QUE ATERRISARAM NA LUA.

    APÓS BAIXAR OS DADOS INICIAMOS O LEITURA DOS DADOS UTILIZANDO PANDAS.

In [1]:
import pandas as pd

rock_samples = pd.read_csv("rocksamples.csv")

In [2]:
rock_samples.head()

      ID   Mission    Type   Subtype  Weight (g)  Pristine (%)
0  10001  Apollo11    Soil  Unsieved       125.8         88.36
1  10002  Apollo11    Soil  Unsieved      5629.0         93.73
2  10003  Apollo11  Basalt  Ilmenite       213.0         65.56
3  10004  Apollo11    Core  Unsieved        44.8         71.76
4  10005  Apollo11    Core  Unsieved        53.4         40.31

Para saber obter mais informações sobre a amostra, podemos rodar o comando .info().

Como podemos ver abaixo, a mostra possui um conjunto de 2229 linhas; por seis colunas;

In [3]:
rock_samples.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2229 entries, 0 to 2228
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            2229 non-null   int64
 1   Mission       2229 non-null   object
 2   Type          2229 non-null   object
 3   Subtype       2226 non-null   object
 4   Weight (g)    2229 non-null   float64
 5   Pristine (%)  2229 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 104.6+ KB

Para faciliar a compreensão dos dados, renomeei as colunas.

Afim de não perder a integrade dos dados brutos, primeiro seto o dataset em um dataframe no pandas

In [4]:
df = rock_samples

df.rename(columns={'Mission': 'Missao'}, inplace = True)
df.rename(columns={'Type': 'Tipo'}, inplace = True)
df.rename(columns={'Subtype': 'Subtipo'}, inplace = True)
df.rename(columns={'Weight (g)': 'Peso (g)'}, inplace = True)
df.rename(columns={'Pristine (%)': 'Integridade (%)'}, inplace = True)

df.head()

      ID    Missao    Tipo   Subtipo  Peso (g)  Integridade (%)
0  10001  Apollo11    Soil  Unsieved     125.8            88.36
1  10002  Apollo11    Soil  Unsieved    5629.0            93.73
2  10003  Apollo11  Basalt  Ilmenite     213.0            65.56
3  10004  Apollo11    Core  Unsieved      44.8            71.76
4  10005  Apollo11    Core  Unsieved      53.4            40.31

## 2 - CONVERTER UNIDADE DE PESO DA AMOSTRA

 DEVIDO AO CONTEXTO, LEVAMOS EM CONSIDERAÇÃO QUE O PESO DO FOGUETE É MEDIDO EM QUILOGRAMAS.
 ESSA É UMA CONVERSÃO BEM SIMPLES, UTILIZANDO EXPRESSÃO LAMBDA, OU PSEUDO FUNÇÃO, PODEMOS DIZER QUE UM GRAMA EQUIVALE A 0,001 KG

In [5]:
df['Peso (g)'] = df['Peso (g)'].apply(lambda x :x * 0.001)
df.rename(columns={'Peso (g)': 'Peso (kg)'}, inplace = True)
df.head()

      ID    Missao    Tipo   Subtipo  Peso (kg)  Integridade (%)
0  10001  Apollo11    Soil  Unsieved     0.1258            88.36
1  10002  Apollo11    Soil  Unsieved     5.6290            93.73
2  10003  Apollo11  Basalt  Ilmenite     0.2130            65.56
3  10004  Apollo11    Core  Unsieved     0.0448            71.76
4  10005  Apollo11    Core  Unsieved     0.0534            40.31

## 3 - DEFINIR DATAFRAME DE ANALISE

ESSE DATA FRAME É BASICAMENTE UM RESUMO DA AMOSTRA. ELE IRÁ CONTER OS DADOS DE CADA MISSÃO CONTIDA NA AMOSTRA

In [6]:
missoes = pd.DataFrame()
missoes['Missao'] = df['Missao'].unique()
missoes.head()

     Missao
0  Apollo11
1  Apollo12
2  Apollo14
3  Apollo15
4  Apollo16

In [7]:
missoes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Missao  6 non-null      object
dtypes: object(1)
memory usage: 176.0+ bytes

Iniciamos os totatilzadores (importante manter ter cuidado com a nomenclatura chave das colunas)

In [8]:
sample_total_weight = df.groupby('Missao')['Peso (kg)'].sum()
missoes = pd.merge(missoes, sample_total_weight, on='Missao')
missoes.rename(columns={'Peso (kg)':'Peso amostra (kg)'}, inplace=True)
missoes

     Missao  Peso amostra (kg)
0  Apollo11           21.55424
1  Apollo12           34.34238
2  Apollo14           41.83363
3  Apollo15           75.39910
4  Apollo16           92.46262
5  Apollo17          109.44402

Se você fosse imprimir essa linha, teria uma série pandas, que é basicamente um tipo de dados em 1D, ou uma lista. A lista teria como índice o valor exclusivo da coluna Missão em vez de um número:

In [9]:
sample_total_weight = df.groupby('Missao')['Peso (kg)'].sum()
sample_total_weight

Missao
Apollo11     21.55424
Apollo12     34.34238
Apollo14     41.83363
Apollo15     75.39910
Apollo16     92.46262
Apollo17    109.44402
Name: Peso (kg), dtype: float64

In [10]:
missoes['DiferencaPeso'] = missoes['Peso amostra (kg)'].diff()
missoes

     Missao  Peso amostra (kg)  DiferencaPeso
0  Apollo11           21.55424            NaN
1  Apollo12           34.34238       12.78814
2  Apollo14           41.83363        7.49125
3  Apollo15           75.39910       33.56547
4  Apollo16           92.46262       17.06352
5  Apollo17          109.44402       16.98140

Substituimos valores NaN (Not is a Number) para 0

In [11]:
missoes['DiferencaPeso'] = missoes['DiferencaPeso'].fillna(value=0)
missoes

     Missao  Peso amostra (kg)  DiferencaPeso
0  Apollo11           21.55424        0.00000
1  Apollo12           34.34238       12.78814
2  Apollo14           41.83363        7.49125
3  Apollo15           75.39910       33.56547
4  Apollo16           92.46262       17.06352
5  Apollo17          109.44402       16.98140

# 4 - ADICIONAMOS AO DATASET DADOS DE MODULOS LUNARES E DE COMANDO

In [12]:
missoes['Modulo lunar (LM)'] = 'Eagle (LM-5)', 'Intrepid (LM-6)', 'Antares (LM-8)', 'Falcon (LM-10)', 'Orion (LM-11)', 'Challenger (LM-12)'
missoes['LM massa (kg)'] = 15103, 15235, 15264, 16430, 16445, 16456
missoes['LM massa diff'] = missoes['LM massa (kg)'].diff()
missoes['LM massa diff'] = missoes['LM massa diff'].fillna(value=0)

missoes['Modulo comando (CM)'] = 'Columbia (CSM-107)', 'Yankee Clipper (CM-108)', 'Kitty Hawk (CM-110)', 'Endeavor (CM-112)', 'Casper (CM-113)', 'America (CM-114)'
missoes['CM massa (kg)'] = 5560, 5609, 5758, 5875, 5840, 5960
missoes['CM massa diff'] = missoes['CM massa (kg)'].diff()
missoes['CM massa diff'] = missoes['CM massa diff'].fillna(value=0)

missoes

,Missao,Peso amostra (kg),DiferencaPeso,Modulo lunar (LM),LM massa (kg),LM massa diff,Modulo comando (CM),CM massa (kg),CM massa diff
0,Apollo11,21.55424,0.00000,Eagle (LM-5),15103,0.0,Columbia (CSM-107),5560,0.0
1,Apollo12,34.34238,12.78814,Intrepid (LM-6),15235,132.0,Yankee Clipper (CM-108),5609,49.0
2,Apollo14,41.83363,7.49125,Antares (LM-8),15264,29.0,Kitty Hawk (CM-110),5758,149.0
3,Apollo15,75.39910,33.56547,Falcon (LM-10),16430,1166.0,Endeavor (CM-112),5875,117.0
4,Apollo16,92.46262,17.06352,Orion (LM-11),16445,15.0,Casper (CM-113),5840,-35.0
5,Apollo17,109.44402,16.98140,Challenger (LM-12),16456,11.0,America (CM-114),5960,120.0

Adicionamos totalizadores para cada missao

In [13]:
missoes['Total peso (kg)'] = missoes['LM massa (kg)'] + missoes['CM massa (kg)']
missoes['Total peso dif'] = missoes['LM massa diff'] + missoes['CM massa diff']
missoes

,Missao,Peso amostra (kg),DiferencaPeso,Modulo lunar (LM),LM massa (kg),LM massa diff,Modulo comando (CM),CM massa (kg),CM massa diff,Total peso (kg),Total peso dif
0,Apollo11,21.55424,0.00000,Eagle (LM-5),15103,0.0,Columbia (CSM-107),5560,0.0,20663,0.0
1,Apollo12,34.34238,12.78814,Intrepid (LM-6),15235,132.0,Yankee Clipper (CM-108),5609,49.0,20844,181.0
2,Apollo14,41.83363,7.49125,Antares (LM-8),15264,29.0,Kitty Hawk (CM-110),5758,149.0,21022,178.0
3,Apollo15,75.39910,33.56547,Falcon (LM-10),16430,1166.0,Endeavor (CM-112),5875,117.0,22305,1283.0
4,Apollo16,92.46262,17.06352,Orion (LM-11),16445,15.0,Casper (CM-113),5840,-35.0,22285,-20.0
5,Apollo17,109.44402,16.98140,Challenger (LM-12),16456,11.0,America (CM-114),5960,120.0,22416,131.0

In [16]:
# Sample-to-weight ratio
saturnVPayload = 43500
missoes['Crewed area : Payload'] = missoes['Total peso (kg)'] / saturnVPayload
missoes['Sample : Crewed area'] = missoes['Peso amostra (kg)'] / missoes['Total peso (kg)']
missoes['Sample : Payload'] = missoes['Peso amostra (kg)'] / saturnVPayload
missoes

,Missao,Peso amostra (kg),DiferencaPeso,Modulo lunar (LM),LM massa (kg),LM massa diff,Modulo comando (CM),CM massa (kg),CM massa diff,Total peso (kg),Total peso dif,Crewed area : Payload,Sample : Crewed area,Sample : Payload
0,Apollo11,21.55424,0.00000,Eagle (LM-5),15103,0.0,Columbia (CSM-107),5560,0.0,20663,0.0,0.475011,0.001043,0.000495
1,Apollo12,34.34238,12.78814,Intrepid (LM-6),15235,132.0,Yankee Clipper (CM-108),5609,49.0,20844,181.0,0.479172,0.001648,0.000789
2,Apollo14,41.83363,7.49125,Antares (LM-8),15264,29.0,Kitty Hawk (CM-110),5758,149.0,21022,178.0,0.483264,0.001990,0.000962
3,Apollo15,75.39910,33.56547,Falcon (LM-10),16430,1166.0,Endeavor (CM-112),5875,117.0,22305,1283.0,0.512759,0.003380,0.001733
4,Apollo16,92.46262,17.06352,Orion (LM-11),16445,15.0,Casper (CM-113),5840,-35.0,22285,-20.0,0.512299,0.004149,0.002126
5,Apollo17,109.44402,16.98140,Challenger (LM-12),16456,11.0,America (CM-114),5960,120.0,22416,131.0,0.515310,0.004882,0.002516

In [17]:
crewedArea_payload_ratio = missoes['Crewed area : Payload'].mean()
sample_crewedArea_ratio = missoes['Sample : Crewed area'].mean()
sample_payload_ratio = missoes['Sample : Payload'].mean()
print(crewedArea_payload_ratio)
print(sample_crewedArea_ratio)
print(sample_payload_ratio)

0.4963026819923371
0.002848764392685611
0.0014369195019157087